{"inkVersion":20,"root":[["\n",{"->":"mothman_start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"mothman_start":[["^<i>You are hiking with your friends on a weekend vacation atop the Appalachian mountains.",{"#":"sprite:null"},{"#":"name:"},"\n","^<i>It’s been a tiring experience, and honestly, it hasn’t been fun.","\n","^<i>Apparently, there’s supposed to be sightings of Mothman, promised by your friends.","\n","^<i>But it’s been rather…lame.","\n","^<i>You decide to leave your tent and get some fresh air, as your friends are being loud by the campfire, telling boring horror stories.","\n","^<i>You know what would be exciting?","\n","^<i>Actually meeting a folklore being!","\n","^<i>Suddenly, the ground beneath your feet crumbles, causing you to slip and fall.","\n","^<i>You tumble down the mountain side, luckily avoiding some trees.","\n","^<i>As you land back first somewhere, the only light is your flashlight that somehow didn’t break, you force yourself to crawl and lean against a tree.","\n","^<i>That’s when you see those red eyes.","\n","^<i>At first, you are scared. What on earth has red eyes?! But as you shine your flashlight on the red eyes, you see…him.",{"#":"sprite:mothman_hidden"},"\n","^<i>You immediately recognize him from the statue of the nearby town.","\n","^<i>IT’S MOTHMAN!","\n","^!!!",{"#":"name:Mothman"},{"#":"sprite:mothman_covered"},"\n","^<i>He seems to be…distressed?",{"#":"name:"},"\n","^Woah…",{"#":"name: You"},"\n","^<i>It’s Mothman…staring at you.",{"#":"name:"},"\n","^<i>You have a weird feeling inside you…","\n","^<i>It’s…excitement?","\n","^<i>Excitement!","\n","^<i>Something interesting has finally happened to you!","\n","^Murrr!",{"#":"name:Mothman"},"\n","^<i>He’s frantically waving his wings up and down at you. You don’t understand what he’s implying.",{"#":"sprite:mothman_open"},{"#":"name:"},"\n","^<i>Maybe it’s your arm injury you just noticed? You know, the one that’s being a bitch and feeling painful right now?","\n","^Owwwww!",{"#":"name: You"},"\n","^Murr! Murr!",{"#":"name:Mothman"},"\n","^<i>He flutters over to you, his hands gently touching your broken arm.",{"#":"name:"},"\n","^<i>Oh my god, MOTHMAN IS TOUCHING YOU.","\n","^<i>His hands are surprisingly warm. Soft and fuzzy. You realize that he’s close to a human with wings rather than a monstrosity with insect-like features.","\n","^<i>Kinda looks hot…","\n","^Murr…",{"#":"name:Mothman"},"\n","^<i>He lets go of your arm, much to your dismay. Instead, he motions for you to follow him. Maybe he’s bringing you back to your camp.",{"#":"name:"},"\n","^<i>You might be able to show him to the others! To scare them!","\n","^<i>Or maybe he’s bringing you to a hospital? Does he even know what a hospital is?","\n","^<i>Anyways, do you even follow him?","\n","ev","str","^Yes...","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^YES!!!","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"mothman_follow"},{"#f":5}],"c-1":["\n",{"->":"mothman_follow"},{"#f":5}]}],{"#f":1}],"mothman_follow":["^<i>The answer is yes.","\n","^<i>Yes you do.","\n","^<i>You trail behind Mothman, holding your flashlight in your left hand. Mothman seems…focused?","\n","^<i>Focused on what?","\n","^<i>Focused on you…","\n","^<i>You? Worthy of Mothman’s focus?","\n","ev",true,"/ev",{"VAR=":"end","re":true},"end",{"#f":1}],"global decl":["ev",1,{"VAR=":"expression_int"},false,{"VAR=":"end"},"/ev","end",null],"#f":1}],"listDefs":{}}